tugas 9/benchmark_async/test_result_1.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        myserver/1.0
Server Hostname:        127.0.0.1
Server Port:            45000

Document Path:          /
Document Length:        4 bytes

Concurrency Level:      1
Time taken for tests:   3.324 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      122000 bytes
HTML transferred:       4000 bytes
Requests per second:    300.88 [#/sec] (mean)
Time per request:       3.324 [ms] (mean)
Time per request:       3.324 [ms] (mean, across all concurrent requests)
Transfer rate:          35.85 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     2    3   2.2      2      47
Waiting:        2    3   2.2      2      47
Total:          2    3   2.3      3      47

Percentage of the requests served within a certain time (ms)
  50%      3
  66%      3
  75%      3
  80%      4
  90%      4
  95%      6
  98%      8
  99%     10
 100%     47 (longest request)